Microchip-MPLAB-Harmony/reference_apps/apps/sam_l11_xpro/saml11_trustzone_getting_started/firmware/NonSecure/firmware/src/packs/ATSAML11E16A_DFP/component/fuses.h
#define FUSES_BOCOR_WORD_0_IDAU_BS_Pos        _U_(8)                                               /**< (FUSES_BOCOR_WORD_0) Boot Secure Position */
#define FUSES_BOCOR_WORD_0_IDAU_BS_Msk        (_U_(0xFF) << FUSES_BOCOR_WORD_0_IDAU_BS_Pos)        /**< (FUSES_BOCOR_WORD_0) Boot Secure Mask */
#define FUSES_BOCOR_WORD_0_IDAU_BS(value)     (FUSES_BOCOR_WORD_0_IDAU_BS_Msk & ((value) << FUSES_BOCOR_WORD_0_IDAU_BS_Pos))
#define FUSES_BOCOR_WORD_0_IDAU_BNSC_Pos      _U_(16)                                              /**< (FUSES_BOCOR_WORD_0) Boot Non-Secure Callable Position */
#define FUSES_BOCOR_WORD_0_IDAU_BNSC_Msk      (_U_(0x3F) << FUSES_BOCOR_WORD_0_IDAU_BNSC_Pos)      /**< (FUSES_BOCOR_WORD_0) Boot Non-Secure Callable Mask */
#define FUSES_BOCOR_WORD_0_IDAU_BNSC(value)   (FUSES_BOCOR_WORD_0_IDAU_BNSC_Msk & ((value) << FUSES_BOCOR_WORD_0_IDAU_BNSC_Pos))
#define FUSES_BOCOR_WORD_0_BOOTROM_BOOTOPT_Pos _U_(24)                                              /**< (FUSES_BOCOR_WORD_0) Boot Option Position */
#define FUSES_BOCOR_WORD_0_BOOTROM_BOOTOPT_Msk (_U_(0xFF) << FUSES_BOCOR_WORD_0_BOOTROM_BOOTOPT_Pos) /**< (FUSES_BOCOR_WORD_0) Boot Option Mask */
#define FUSES_BOCOR_WORD_0_BOOTROM_BOOTOPT(value) (FUSES_BOCOR_WORD_0_BOOTROM_BOOTOPT_Msk & ((value) << FUSES_BOCOR_WORD_0_BOOTROM_BOOTOPT_Pos))
#define FUSES_BOCOR_WORD_0_Msk                _U_(0xFF3FFF00)                                      /**< (FUSES_BOCOR_WORD_0) Register Mask  */


/* -------- FUSES_BOCOR_WORD_1 : (FUSES Offset: 0x04) (R/W 32) BOCOR Page Word 1 -------- */
#define FUSES_BOCOR_WORD_1_RESETVALUE         _U_(0xFFFFFF00)                                      /**<  (FUSES_BOCOR_WORD_1) BOCOR Page Word 1  Reset Value */

#define FUSES_BOCOR_WORD_1_IDAU_BOOTPROT_Pos  _U_(0)                                               /**< (FUSES_BOCOR_WORD_1) Boot Protection Position */
#define FUSES_BOCOR_WORD_1_IDAU_BOOTPROT_Msk  (_U_(0xFF) << FUSES_BOCOR_WORD_1_IDAU_BOOTPROT_Pos)  /**< (FUSES_BOCOR_WORD_1) Boot Protection Mask */
#define FUSES_BOCOR_WORD_1_IDAU_BOOTPROT(value) (FUSES_BOCOR_WORD_1_IDAU_BOOTPROT_Msk & ((value) << FUSES_BOCOR_WORD_1_IDAU_BOOTPROT_Pos))
#define FUSES_BOCOR_WORD_1_NVMCTRL_BCWEN_Pos  _U_(16)                                              /**< (FUSES_BOCOR_WORD_1) Boot Configuration Write Enable Position */
#define FUSES_BOCOR_WORD_1_NVMCTRL_BCWEN_Msk  (_U_(0x1) << FUSES_BOCOR_WORD_1_NVMCTRL_BCWEN_Pos)   /**< (FUSES_BOCOR_WORD_1) Boot Configuration Write Enable Mask */
#define FUSES_BOCOR_WORD_1_NVMCTRL_BCWEN(value) (FUSES_BOCOR_WORD_1_NVMCTRL_BCWEN_Msk & ((value) << FUSES_BOCOR_WORD_1_NVMCTRL_BCWEN_Pos))
#define FUSES_BOCOR_WORD_1_NVMCTRL_BCREN_Pos  _U_(17)                                              /**< (FUSES_BOCOR_WORD_1) Boot Configuration Read Enable Position */
#define FUSES_BOCOR_WORD_1_NVMCTRL_BCREN_Msk  (_U_(0x1) << FUSES_BOCOR_WORD_1_NVMCTRL_BCREN_Pos)   /**< (FUSES_BOCOR_WORD_1) Boot Configuration Read Enable Mask */
#define FUSES_BOCOR_WORD_1_NVMCTRL_BCREN(value) (FUSES_BOCOR_WORD_1_NVMCTRL_BCREN_Msk & ((value) << FUSES_BOCOR_WORD_1_NVMCTRL_BCREN_Pos))
#define FUSES_BOCOR_WORD_1_Msk                _U_(0x000300FF)                                      /**< (FUSES_BOCOR_WORD_1) Register Mask  */


/* -------- FUSES_BOCOR_WORD_2 : (FUSES Offset: 0x08) (R/W 32) BOCOR Page Word 2 -------- */
#define FUSES_BOCOR_WORD_2_RESETVALUE         _U_(0xDDE78140)                                      /**<  (FUSES_BOCOR_WORD_2) BOCOR Page Word 2  Reset Value */

#define FUSES_BOCOR_WORD_2_BOOTROM_BOCORCRC_Pos _U_(0)                                               /**< (FUSES_BOCOR_WORD_2) CRC for BOCOR DWORD0 Position */
#define FUSES_BOCOR_WORD_2_BOOTROM_BOCORCRC_Msk (_U_(0xFFFFFFFF) << FUSES_BOCOR_WORD_2_BOOTROM_BOCORCRC_Pos) /**< (FUSES_BOCOR_WORD_2) CRC for BOCOR DWORD0 Mask */
#define FUSES_BOCOR_WORD_2_BOOTROM_BOCORCRC(value) (FUSES_BOCOR_WORD_2_BOOTROM_BOCORCRC_Msk & ((value) << FUSES_BOCOR_WORD_2_BOOTROM_BOCORCRC_Pos))
#define FUSES_BOCOR_WORD_2_Msk                _U_(0xFFFFFFFF)                                      /**< (FUSES_BOCOR_WORD_2) Register Mask  */


/* -------- FUSES_BOCOR_WORD_4 : (FUSES Offset: 0x10) (R/W 32) BOCOR Page Word 4 -------- */
#define FUSES_BOCOR_WORD_4_RESETVALUE         _U_(0xFFFFFFFF)                                      /**<  (FUSES_BOCOR_WORD_4) BOCOR Page Word 4  Reset Value */

#define FUSES_BOCOR_WORD_4_BOOTROM_CEKEY0_0_Pos _U_(0)                                               /**< (FUSES_BOCOR_WORD_4) Chip Erase Key 0 bits 31:0 Position */
#define FUSES_BOCOR_WORD_4_BOOTROM_CEKEY0_0_Msk (_U_(0xFFFFFFFF) << FUSES_BOCOR_WORD_4_BOOTROM_CEKEY0_0_Pos) /**< (FUSES_BOCOR_WORD_4) Chip Erase Key 0 bits 31:0 Mask */
#define FUSES_BOCOR_WORD_4_BOOTROM_CEKEY0_0(value) (FUSES_BOCOR_WORD_4_BOOTROM_CEKEY0_0_Msk & ((value) << FUSES_BOCOR_WORD_4_BOOTROM_CEKEY0_0_Pos))
#define FUSES_BOCOR_WORD_4_Msk                _U_(0xFFFFFFFF)                                      /**< (FUSES_BOCOR_WORD_4) Register Mask  */


/* -------- FUSES_BOCOR_WORD_5 : (FUSES Offset: 0x14) (R/W 32) BOCOR Page Word 5 -------- */
#define FUSES_BOCOR_WORD_5_RESETVALUE         _U_(0xFFFFFFFF)                                      /**<  (FUSES_BOCOR_WORD_5) BOCOR Page Word 5  Reset Value */

#define FUSES_BOCOR_WORD_5_BOOTROM_CEKEY0_1_Pos _U_(0)                                               /**< (FUSES_BOCOR_WORD_5) Chip Erase Key 0 bits 63:32 Position */
#define FUSES_BOCOR_WORD_5_BOOTROM_CEKEY0_1_Msk (_U_(0xFFFFFFFF) << FUSES_BOCOR_WORD_5_BOOTROM_CEKEY0_1_Pos) /**< (FUSES_BOCOR_WORD_5) Chip Erase Key 0 bits 63:32 Mask */
#define FUSES_BOCOR_WORD_5_BOOTROM_CEKEY0_1(value) (FUSES_BOCOR_WORD_5_BOOTROM_CEKEY0_1_Msk & ((value) << FUSES_BOCOR_WORD_5_BOOTROM_CEKEY0_1_Pos))
#define FUSES_BOCOR_WORD_5_Msk                _U_(0xFFFFFFFF)                                      /**< (FUSES_BOCOR_WORD_5) Register Mask  */


/* -------- FUSES_BOCOR_WORD_6 : (FUSES Offset: 0x18) (R/W 32) BOCOR Page Word 6 -------- */
#define FUSES_BOCOR_WORD_6_RESETVALUE         _U_(0xFFFFFFFF)                                      /**<  (FUSES_BOCOR_WORD_6) BOCOR Page Word 6  Reset Value */

#define FUSES_BOCOR_WORD_6_BOOTROM_CEKEY0_2_Pos _U_(0)                                               /**< (FUSES_BOCOR_WORD_6) Chip Erase Key 0 bits 95:64 Position */
#define FUSES_BOCOR_WORD_6_BOOTROM_CEKEY0_2_Msk (_U_(0xFFFFFFFF) << FUSES_BOCOR_WORD_6_BOOTROM_CEKEY0_2_Pos) /**< (FUSES_BOCOR_WORD_6) Chip Erase Key 0 bits 95:64 Mask */
#define FUSES_BOCOR_WORD_6_BOOTROM_CEKEY0_2(value) (FUSES_BOCOR_WORD_6_BOOTROM_CEKEY0_2_Msk & ((value) << FUSES_BOCOR_WORD_6_BOOTROM_CEKEY0_2_Pos))
#define FUSES_BOCOR_WORD_6_Msk                _U_(0xFFFFFFFF)                                      /**< (FUSES_BOCOR_WORD_6) Register Mask  */


/* -------- FUSES_BOCOR_WORD_7 : (FUSES Offset: 0x1C) (R/W 32) BOCOR Page Word 7 -------- */
#define FUSES_BOCOR_WORD_7_RESETVALUE         _U_(0xFFFFFFFF)                                      /**<  (FUSES_BOCOR_WORD_7) BOCOR Page Word 7  Reset Value */

#define FUSES_BOCOR_WORD_7_BOOTROM_CEKEY0_3_Pos _U_(0)                                               /**< (FUSES_BOCOR_WORD_7) Chip Erase Key 0 bits 127:96 Position */
#define FUSES_BOCOR_WORD_7_BOOTROM_CEKEY0_3_Msk (_U_(0xFFFFFFFF) << FUSES_BOCOR_WORD_7_BOOTROM_CEKEY0_3_Pos) /**< (FUSES_BOCOR_WORD_7) Chip Erase Key 0 bits 127:96 Mask */
#define FUSES_BOCOR_WORD_7_BOOTROM_CEKEY0_3(value) (FUSES_BOCOR_WORD_7_BOOTROM_CEKEY0_3_Msk & ((value) << FUSES_BOCOR_WORD_7_BOOTROM_CEKEY0_3_Pos))
#define FUSES_BOCOR_WORD_7_Msk                _U_(0xFFFFFFFF)                                      /**< (FUSES_BOCOR_WORD_7) Register Mask  */


