Microchip-MPLAB-Harmony/reference_apps/apps/sam_l11_xpro/saml11_trustzone_getting_started/firmware/NonSecure/firmware/src/packs/ATSAML11E16A_DFP/component/fuses.h
/* -------- FUSES_USER_WORD_3 : (FUSES Offset: 0x0C) (R/W 32) USER Page Word 3 -------- */
#define FUSES_USER_WORD_3_RESETVALUE          _U_(0xFFFFFFFF)                                      /**<  (FUSES_USER_WORD_3) USER Page Word 3  Reset Value */

#define FUSES_USER_WORD_3_NVMCTRL_URWEN_Pos   _U_(0)                                               /**< (FUSES_USER_WORD_3) User Row Write Enable Position */
#define FUSES_USER_WORD_3_NVMCTRL_URWEN_Msk   (_U_(0x1) << FUSES_USER_WORD_3_NVMCTRL_URWEN_Pos)    /**< (FUSES_USER_WORD_3) User Row Write Enable Mask */
#define FUSES_USER_WORD_3_NVMCTRL_URWEN(value) (FUSES_USER_WORD_3_NVMCTRL_URWEN_Msk & ((value) << FUSES_USER_WORD_3_NVMCTRL_URWEN_Pos))
#define FUSES_USER_WORD_3_Msk                 _U_(0x00000001)                                      /**< (FUSES_USER_WORD_3) Register Mask  */


/* -------- FUSES_USER_WORD_4 : (FUSES Offset: 0x10) (R/W 32) USER Page Word 4 -------- */
#define FUSES_USER_WORD_4_RESETVALUE          _U_(0x00)                                            /**<  (FUSES_USER_WORD_4) USER Page Word 4  Reset Value */

#define FUSES_USER_WORD_4_NONSECA_PAC_Pos     _U_(0)                                               /**< (FUSES_USER_WORD_4) PAC Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_PAC_Msk     (_U_(0x1) << FUSES_USER_WORD_4_NONSECA_PAC_Pos)      /**< (FUSES_USER_WORD_4) PAC Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_PAC(value)  (FUSES_USER_WORD_4_NONSECA_PAC_Msk & ((value) << FUSES_USER_WORD_4_NONSECA_PAC_Pos))
#define FUSES_USER_WORD_4_NONSECA_PM_Pos      _U_(1)                                               /**< (FUSES_USER_WORD_4) PM Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_PM_Msk      (_U_(0x1) << FUSES_USER_WORD_4_NONSECA_PM_Pos)       /**< (FUSES_USER_WORD_4) PM Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_PM(value)   (FUSES_USER_WORD_4_NONSECA_PM_Msk & ((value) << FUSES_USER_WORD_4_NONSECA_PM_Pos))
#define FUSES_USER_WORD_4_NONSECA_MCLK_Pos    _U_(2)                                               /**< (FUSES_USER_WORD_4) MCLK Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_MCLK_Msk    (_U_(0x1) << FUSES_USER_WORD_4_NONSECA_MCLK_Pos)     /**< (FUSES_USER_WORD_4) MCLK Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_MCLK(value) (FUSES_USER_WORD_4_NONSECA_MCLK_Msk & ((value) << FUSES_USER_WORD_4_NONSECA_MCLK_Pos))
#define FUSES_USER_WORD_4_NONSECA_RSTC_Pos    _U_(3)                                               /**< (FUSES_USER_WORD_4) RSTC Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_RSTC_Msk    (_U_(0x1) << FUSES_USER_WORD_4_NONSECA_RSTC_Pos)     /**< (FUSES_USER_WORD_4) RSTC Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_RSTC(value) (FUSES_USER_WORD_4_NONSECA_RSTC_Msk & ((value) << FUSES_USER_WORD_4_NONSECA_RSTC_Pos))
#define FUSES_USER_WORD_4_NONSECA_OSCCTRL_Pos _U_(4)                                               /**< (FUSES_USER_WORD_4) OSCCTRL Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_OSCCTRL_Msk (_U_(0x1) << FUSES_USER_WORD_4_NONSECA_OSCCTRL_Pos)  /**< (FUSES_USER_WORD_4) OSCCTRL Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_OSCCTRL(value) (FUSES_USER_WORD_4_NONSECA_OSCCTRL_Msk & ((value) << FUSES_USER_WORD_4_NONSECA_OSCCTRL_Pos))
#define FUSES_USER_WORD_4_NONSECA_OSC32KCTRL_Pos _U_(5)                                               /**< (FUSES_USER_WORD_4) OSC32KCTRL Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_OSC32KCTRL_Msk (_U_(0x1) << FUSES_USER_WORD_4_NONSECA_OSC32KCTRL_Pos) /**< (FUSES_USER_WORD_4) OSC32KCTRL Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_OSC32KCTRL(value) (FUSES_USER_WORD_4_NONSECA_OSC32KCTRL_Msk & ((value) << FUSES_USER_WORD_4_NONSECA_OSC32KCTRL_Pos))
#define FUSES_USER_WORD_4_NONSECA_SUPC_Pos    _U_(6)                                               /**< (FUSES_USER_WORD_4) SUPC Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_SUPC_Msk    (_U_(0x1) << FUSES_USER_WORD_4_NONSECA_SUPC_Pos)     /**< (FUSES_USER_WORD_4) SUPC Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_SUPC(value) (FUSES_USER_WORD_4_NONSECA_SUPC_Msk & ((value) << FUSES_USER_WORD_4_NONSECA_SUPC_Pos))
#define FUSES_USER_WORD_4_NONSECA_GCLK_Pos    _U_(7)                                               /**< (FUSES_USER_WORD_4) GCLK Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_GCLK_Msk    (_U_(0x1) << FUSES_USER_WORD_4_NONSECA_GCLK_Pos)     /**< (FUSES_USER_WORD_4) GCLK Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_GCLK(value) (FUSES_USER_WORD_4_NONSECA_GCLK_Msk & ((value) << FUSES_USER_WORD_4_NONSECA_GCLK_Pos))
#define FUSES_USER_WORD_4_NONSECA_WDT_Pos     _U_(8)                                               /**< (FUSES_USER_WORD_4) WDT Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_WDT_Msk     (_U_(0x1) << FUSES_USER_WORD_4_NONSECA_WDT_Pos)      /**< (FUSES_USER_WORD_4) WDT Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_WDT(value)  (FUSES_USER_WORD_4_NONSECA_WDT_Msk & ((value) << FUSES_USER_WORD_4_NONSECA_WDT_Pos))
#define FUSES_USER_WORD_4_NONSECA_RTC_Pos     _U_(9)                                               /**< (FUSES_USER_WORD_4) RTC Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_RTC_Msk     (_U_(0x1) << FUSES_USER_WORD_4_NONSECA_RTC_Pos)      /**< (FUSES_USER_WORD_4) RTC Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_RTC(value)  (FUSES_USER_WORD_4_NONSECA_RTC_Msk & ((value) << FUSES_USER_WORD_4_NONSECA_RTC_Pos))
#define FUSES_USER_WORD_4_NONSECA_EIC_Pos     _U_(10)                                              /**< (FUSES_USER_WORD_4) EIC Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_EIC_Msk     (_U_(0x1) << FUSES_USER_WORD_4_NONSECA_EIC_Pos)      /**< (FUSES_USER_WORD_4) EIC Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_EIC(value)  (FUSES_USER_WORD_4_NONSECA_EIC_Msk & ((value) << FUSES_USER_WORD_4_NONSECA_EIC_Pos))
#define FUSES_USER_WORD_4_NONSECA_FREQM_Pos   _U_(11)                                              /**< (FUSES_USER_WORD_4) FREQM Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_FREQM_Msk   (_U_(0x1) << FUSES_USER_WORD_4_NONSECA_FREQM_Pos)    /**< (FUSES_USER_WORD_4) FREQM Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_FREQM(value) (FUSES_USER_WORD_4_NONSECA_FREQM_Msk & ((value) << FUSES_USER_WORD_4_NONSECA_FREQM_Pos))
#define FUSES_USER_WORD_4_NONSECA_PORT_Pos    _U_(12)                                              /**< (FUSES_USER_WORD_4) PORT Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_PORT_Msk    (_U_(0x1) << FUSES_USER_WORD_4_NONSECA_PORT_Pos)     /**< (FUSES_USER_WORD_4) PORT Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_PORT(value) (FUSES_USER_WORD_4_NONSECA_PORT_Msk & ((value) << FUSES_USER_WORD_4_NONSECA_PORT_Pos))
#define FUSES_USER_WORD_4_NONSECA_AC_Pos      _U_(13)                                              /**< (FUSES_USER_WORD_4) AC Non-Secure Position */
#define FUSES_USER_WORD_4_NONSECA_AC_Msk      (_U_(0x1) << FUSES_USER_WORD_4_NONSECA_AC_Pos)       /**< (FUSES_USER_WORD_4) AC Non-Secure Mask */
#define FUSES_USER_WORD_4_NONSECA_AC(value)   (FUSES_USER_WORD_4_NONSECA_AC_Msk & ((value) << FUSES_USER_WORD_4_NONSECA_AC_Pos))
#define FUSES_USER_WORD_4_Msk                 _U_(0x00003FFF)                                      /**< (FUSES_USER_WORD_4) Register Mask  */


