Microchip-MPLAB-Harmony/reference_apps/apps/sam_l11_xpro/saml11_trustzone_getting_started/firmware/NonSecure/firmware/src/packs/ATSAML11E16A_DFP/component/fuses.h
/* -------- FUSES_USER_WORD_5 : (FUSES Offset: 0x14) (R/W 32) USER Page Word 5 -------- */
#define FUSES_USER_WORD_5_RESETVALUE          _U_(0x00)                                            /**<  (FUSES_USER_WORD_5) USER Page Word 5  Reset Value */

#define FUSES_USER_WORD_5_NONSECB_IDAU_Pos    _U_(0)                                               /**< (FUSES_USER_WORD_5) IDAU Non-Secure Position */
#define FUSES_USER_WORD_5_NONSECB_IDAU_Msk    (_U_(0x1) << FUSES_USER_WORD_5_NONSECB_IDAU_Pos)     /**< (FUSES_USER_WORD_5) IDAU Non-Secure Mask */
#define FUSES_USER_WORD_5_NONSECB_IDAU(value) (FUSES_USER_WORD_5_NONSECB_IDAU_Msk & ((value) << FUSES_USER_WORD_5_NONSECB_IDAU_Pos))
#define FUSES_USER_WORD_5_NONSECB_DSU_Pos     _U_(1)                                               /**< (FUSES_USER_WORD_5) DSU Non-Secure Position */
#define FUSES_USER_WORD_5_NONSECB_DSU_Msk     (_U_(0x1) << FUSES_USER_WORD_5_NONSECB_DSU_Pos)      /**< (FUSES_USER_WORD_5) DSU Non-Secure Mask */
#define FUSES_USER_WORD_5_NONSECB_DSU(value)  (FUSES_USER_WORD_5_NONSECB_DSU_Msk & ((value) << FUSES_USER_WORD_5_NONSECB_DSU_Pos))
#define FUSES_USER_WORD_5_NONSECB_NVMCTRL_Pos _U_(2)                                               /**< (FUSES_USER_WORD_5) NVMCTRL Non-Secure Position */
#define FUSES_USER_WORD_5_NONSECB_NVMCTRL_Msk (_U_(0x1) << FUSES_USER_WORD_5_NONSECB_NVMCTRL_Pos)  /**< (FUSES_USER_WORD_5) NVMCTRL Non-Secure Mask */
#define FUSES_USER_WORD_5_NONSECB_NVMCTRL(value) (FUSES_USER_WORD_5_NONSECB_NVMCTRL_Msk & ((value) << FUSES_USER_WORD_5_NONSECB_NVMCTRL_Pos))
#define FUSES_USER_WORD_5_NONSECB_DMAC_Pos    _U_(3)                                               /**< (FUSES_USER_WORD_5) DMAC Non-Secure Position */
#define FUSES_USER_WORD_5_NONSECB_DMAC_Msk    (_U_(0x1) << FUSES_USER_WORD_5_NONSECB_DMAC_Pos)     /**< (FUSES_USER_WORD_5) DMAC Non-Secure Mask */
#define FUSES_USER_WORD_5_NONSECB_DMAC(value) (FUSES_USER_WORD_5_NONSECB_DMAC_Msk & ((value) << FUSES_USER_WORD_5_NONSECB_DMAC_Pos))
#define FUSES_USER_WORD_5_Msk                 _U_(0x0000000F)                                      /**< (FUSES_USER_WORD_5) Register Mask  */


/* -------- FUSES_USER_WORD_6 : (FUSES Offset: 0x18) (R/W 32) USER Page Word 6 -------- */
#define FUSES_USER_WORD_6_RESETVALUE          _U_(0x00)                                            /**<  (FUSES_USER_WORD_6) USER Page Word 6  Reset Value */

#define FUSES_USER_WORD_6_NONSECC_EVSYS_Pos   _U_(0)                                               /**< (FUSES_USER_WORD_6) EVSYS Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_EVSYS_Msk   (_U_(0x1) << FUSES_USER_WORD_6_NONSECC_EVSYS_Pos)    /**< (FUSES_USER_WORD_6) EVSYS Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_EVSYS(value) (FUSES_USER_WORD_6_NONSECC_EVSYS_Msk & ((value) << FUSES_USER_WORD_6_NONSECC_EVSYS_Pos))
#define FUSES_USER_WORD_6_NONSECC_SERCOM0_Pos _U_(1)                                               /**< (FUSES_USER_WORD_6) SERCOM0 Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_SERCOM0_Msk (_U_(0x1) << FUSES_USER_WORD_6_NONSECC_SERCOM0_Pos)  /**< (FUSES_USER_WORD_6) SERCOM0 Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_SERCOM0(value) (FUSES_USER_WORD_6_NONSECC_SERCOM0_Msk & ((value) << FUSES_USER_WORD_6_NONSECC_SERCOM0_Pos))
#define FUSES_USER_WORD_6_NONSECC_SERCOM1_Pos _U_(2)                                               /**< (FUSES_USER_WORD_6) SERCOM1 Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_SERCOM1_Msk (_U_(0x1) << FUSES_USER_WORD_6_NONSECC_SERCOM1_Pos)  /**< (FUSES_USER_WORD_6) SERCOM1 Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_SERCOM1(value) (FUSES_USER_WORD_6_NONSECC_SERCOM1_Msk & ((value) << FUSES_USER_WORD_6_NONSECC_SERCOM1_Pos))
#define FUSES_USER_WORD_6_NONSECC_SERCOM2_Pos _U_(3)                                               /**< (FUSES_USER_WORD_6) SERCOM2 Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_SERCOM2_Msk (_U_(0x1) << FUSES_USER_WORD_6_NONSECC_SERCOM2_Pos)  /**< (FUSES_USER_WORD_6) SERCOM2 Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_SERCOM2(value) (FUSES_USER_WORD_6_NONSECC_SERCOM2_Msk & ((value) << FUSES_USER_WORD_6_NONSECC_SERCOM2_Pos))
#define FUSES_USER_WORD_6_NONSECC_TC0_Pos     _U_(4)                                               /**< (FUSES_USER_WORD_6) TC0 Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_TC0_Msk     (_U_(0x1) << FUSES_USER_WORD_6_NONSECC_TC0_Pos)      /**< (FUSES_USER_WORD_6) TC0 Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_TC0(value)  (FUSES_USER_WORD_6_NONSECC_TC0_Msk & ((value) << FUSES_USER_WORD_6_NONSECC_TC0_Pos))
#define FUSES_USER_WORD_6_NONSECC_TC1_Pos     _U_(5)                                               /**< (FUSES_USER_WORD_6) TC1 Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_TC1_Msk     (_U_(0x1) << FUSES_USER_WORD_6_NONSECC_TC1_Pos)      /**< (FUSES_USER_WORD_6) TC1 Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_TC1(value)  (FUSES_USER_WORD_6_NONSECC_TC1_Msk & ((value) << FUSES_USER_WORD_6_NONSECC_TC1_Pos))
#define FUSES_USER_WORD_6_NONSECC_TC2_Pos     _U_(6)                                               /**< (FUSES_USER_WORD_6) TC2 Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_TC2_Msk     (_U_(0x1) << FUSES_USER_WORD_6_NONSECC_TC2_Pos)      /**< (FUSES_USER_WORD_6) TC2 Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_TC2(value)  (FUSES_USER_WORD_6_NONSECC_TC2_Msk & ((value) << FUSES_USER_WORD_6_NONSECC_TC2_Pos))
#define FUSES_USER_WORD_6_NONSECC_ADC_Pos     _U_(7)                                               /**< (FUSES_USER_WORD_6) ADC Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_ADC_Msk     (_U_(0x1) << FUSES_USER_WORD_6_NONSECC_ADC_Pos)      /**< (FUSES_USER_WORD_6) ADC Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_ADC(value)  (FUSES_USER_WORD_6_NONSECC_ADC_Msk & ((value) << FUSES_USER_WORD_6_NONSECC_ADC_Pos))
#define FUSES_USER_WORD_6_NONSECC_DAC_Pos     _U_(8)                                               /**< (FUSES_USER_WORD_6) DAC Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_DAC_Msk     (_U_(0x1) << FUSES_USER_WORD_6_NONSECC_DAC_Pos)      /**< (FUSES_USER_WORD_6) DAC Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_DAC(value)  (FUSES_USER_WORD_6_NONSECC_DAC_Msk & ((value) << FUSES_USER_WORD_6_NONSECC_DAC_Pos))
#define FUSES_USER_WORD_6_NONSECC_PTC_Pos     _U_(9)                                               /**< (FUSES_USER_WORD_6) PTC Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_PTC_Msk     (_U_(0x1) << FUSES_USER_WORD_6_NONSECC_PTC_Pos)      /**< (FUSES_USER_WORD_6) PTC Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_PTC(value)  (FUSES_USER_WORD_6_NONSECC_PTC_Msk & ((value) << FUSES_USER_WORD_6_NONSECC_PTC_Pos))
#define FUSES_USER_WORD_6_NONSECC_TRNG_Pos    _U_(10)                                              /**< (FUSES_USER_WORD_6) TRNG Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_TRNG_Msk    (_U_(0x1) << FUSES_USER_WORD_6_NONSECC_TRNG_Pos)     /**< (FUSES_USER_WORD_6) TRNG Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_TRNG(value) (FUSES_USER_WORD_6_NONSECC_TRNG_Msk & ((value) << FUSES_USER_WORD_6_NONSECC_TRNG_Pos))
#define FUSES_USER_WORD_6_NONSECC_CCL_Pos     _U_(11)                                              /**< (FUSES_USER_WORD_6) CCL Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_CCL_Msk     (_U_(0x1) << FUSES_USER_WORD_6_NONSECC_CCL_Pos)      /**< (FUSES_USER_WORD_6) CCL Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_CCL(value)  (FUSES_USER_WORD_6_NONSECC_CCL_Msk & ((value) << FUSES_USER_WORD_6_NONSECC_CCL_Pos))
#define FUSES_USER_WORD_6_NONSECC_OPAMP_Pos   _U_(12)                                              /**< (FUSES_USER_WORD_6) OPAMP Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_OPAMP_Msk   (_U_(0x1) << FUSES_USER_WORD_6_NONSECC_OPAMP_Pos)    /**< (FUSES_USER_WORD_6) OPAMP Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_OPAMP(value) (FUSES_USER_WORD_6_NONSECC_OPAMP_Msk & ((value) << FUSES_USER_WORD_6_NONSECC_OPAMP_Pos))
#define FUSES_USER_WORD_6_NONSECC_TRAM_Pos    _U_(13)                                              /**< (FUSES_USER_WORD_6) TRAM Non-Secure Position */
#define FUSES_USER_WORD_6_NONSECC_TRAM_Msk    (_U_(0x1) << FUSES_USER_WORD_6_NONSECC_TRAM_Pos)     /**< (FUSES_USER_WORD_6) TRAM Non-Secure Mask */
#define FUSES_USER_WORD_6_NONSECC_TRAM(value) (FUSES_USER_WORD_6_NONSECC_TRAM_Msk & ((value) << FUSES_USER_WORD_6_NONSECC_TRAM_Pos))
#define FUSES_USER_WORD_6_Msk                 _U_(0x00003FFF)                                      /**< (FUSES_USER_WORD_6) Register Mask  */

#define FUSES_USER_WORD_6_NONSECC_SERCOM_Pos  _U_(1)                                               /**< (FUSES_USER_WORD_6 Position) SERCOMx Non-Secure */
#define FUSES_USER_WORD_6_NONSECC_SERCOM_Msk  (_U_(0x7) << FUSES_USER_WORD_6_NONSECC_SERCOM_Pos)   /**< (FUSES_USER_WORD_6 Mask) NONSECC_SERCOM */
#define FUSES_USER_WORD_6_NONSECC_SERCOM(value) (FUSES_USER_WORD_6_NONSECC_SERCOM_Msk & ((value) << FUSES_USER_WORD_6_NONSECC_SERCOM_Pos)) 
#define FUSES_USER_WORD_6_NONSECC_TC_Pos      _U_(4)                                               /**< (FUSES_USER_WORD_6 Position) TCx Non-Secure */
#define FUSES_USER_WORD_6_NONSECC_TC_Msk      (_U_(0x7) << FUSES_USER_WORD_6_NONSECC_TC_Pos)       /**< (FUSES_USER_WORD_6 Mask) NONSECC_TC */
#define FUSES_USER_WORD_6_NONSECC_TC(value)   (FUSES_USER_WORD_6_NONSECC_TC_Msk & ((value) << FUSES_USER_WORD_6_NONSECC_TC_Pos)) 

